# https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew
# https://docs.brew.sh/Manpage#bundle-subcommand

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# What does this do
# https://github.com/tomafro/dotfiles/blob/15c83304dbb53c375a80b7092a58837a1a45cc9a/Brewfile#L4
# cask_args appdir: "/Applications", fontdir: "/Library/Fonts/"

# cat replacement https://github.com/sharkdp/bat
brew "bat"

# https://github.com/AlDanial/cloc
brew "cloc"
brew "curl"
brew "readline"
brew "wget"
brew "httpie"

# https://github.com/kcrawford/dockutil
brew "dockutil"

# ls replacement https://github.com/ogham/exa
brew "exa"

# command line fuzzy-finder https://github.com/junegunn/fzf
brew "fzf"

# Find replacement https://github.com/sharkdp/fd
brew "fd"

# https://github.com/cli/cli
brew "gh"

# https://github.com/dandavison/delta#installation
brew "git-delta"

brew "heroku/brew/heroku"

# https://github.com/github/hub
brew "hub"

# https://github.com/ios-control/ios-deploy
# brew "ios-deploy"

# https://github.com/jesseduffield/lazydocker
brew "lazydocker"

# https://github.com/jesseduffield/lazygit
brew "lazygit"

# https://github.com/mas-cli/mas
brew "mas"

# https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# fast node manager
brew "fnm"

# https://github.com/koalaman/shellcheck
brew "shellcheck"

# sed replacemnet https://github.com/chmln/sd
brew "sd"

# copy ssh keys to servers
# https://www.ssh.com/ssh/copy-id
brew "ssh-copy-id"
brew "tldr"
brew "tmux"
brew "trash"

# https://github.com/dylanaraps/neofetch
brew "neovim"
brew "python"
brew "vim"

brew "watchman"

brew "wifi-password"

brew "youtube-dl"
brew "z"
brew "fish"
brew "jq"   # JSON pretty-printer and processor
brew "tree" # Displays directories as trees in the terminal
brew "peco" # Interactive filtering tool. See: https://peco.github.io/#demo
brew "duti" # Helps select default applications for document types on OS X
brew "ag"
brew "mycli" # CLI for MySQL with auto-completion and syntax highlighting

brew "elixir"

# Requires [sk/skim](https://github.com/lotabout/skim) for fco function in `helper_git.fish`
brew "skim"
cask "alfred"
cask "charles"

# Fonts
tap "homebrew/cask-fonts"
cask "font-iosevka"
cask "font-cardo"
cask "font-cormorant"
cask "font-fira-sans"
cask "font-fira-code"
cask "font-fjalla-one"
cask "font-hack"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-spectral"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# chrome without the tracking
cask "chromium"
cask "discord"
cask "firefox"
cask "brave-browser"

# MacOS Automation Tool https://www.hammerspoon.org/
cask "hammerspoon"
cask "imageoptim"
cask "kitty"
cask "alacritty" # https://github.com/alacritty/alacritty/ another terminal
cask "licecap"
cask "notion"
cask "postico"
cask "postman"
cask "postgres"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# https://sizzy.co/ for tailwindscss designing
# brew install --cask sizzy
# cask "sizzy"
