adpyke.vscode-sql-formatter
adrianwilczynski.toggle-hidden
aestheticintegration.iml-vscode
akecel.makefiles-runner
Alexey-Strakh.stackoverflow-search
apollographql.vscode-apollo
austenc.tailwind-docs
benspaulding.procfile
benvp.vscode-hex-pm-intellisense
bit.vscode-bit
BlockInsight.dfinity
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
chenglou92.rescript-vscode
codezombiech.gitignore
ctf0.inverse-search
davesnx.vscode-styled-ppx
dbaeumer.vscode-eslint
docsmsft.docs-markdown
dunstontc.vscode-gitignore-syntax
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
EQuimper.react-native-react-redux
eriklynd.json-tools
esbenp.prettier-vscode
esy.esy-vscode
file-icons.file-icons
flowtype.flow-for-vscode
folke.vscode-monorepo-workspace
formulahendry.code-runner
foxundermoon.shell-format
gamunu.vscode-yarn
garreh.sublime-search-vscode
GitHub.vscode-pull-request-github
GraphQL.vscode-graphql
hecaiming.reactnative-start
howardzuo.vscode-npm-dependency
huytd.searchy-fuzzy
jaredly.reason-vscode
kumar-harsh.graphql-for-vscode
labocho.chmod-command
letmaik.git-tree-compare
lkytal.quicktask
lucasschejtman.vscode-typesearch
lunaryorn.fish-ide
mads-hartmann.bash-ide-vscode
maelvalais.dune
mattlott.copy-github-url
michelemelluso.gitignore
mikestead.dotenv
mjmcloug.vscode-elixir
mohsen1.prettify-json
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cpptools
msjsdiag.debugger-for-chrome
msjsdiag.vscode-react-native
mushan.vscode-open-iterm2
ocamllabs.ocaml-platform
pflannery.vscode-versionlens
piotrpalarz.vscode-gitignore-generator
PKief.material-icon-theme
remimarsal.prettier-now
rust-lang.rust
ryu1kn.edit-with-shell
shaharkazaz.git-merger
shakram02.bash-beautify
Shan.code-settings-sync
shd101wyy.markdown-preview-enhanced
skyapps.fish-vscode
sterin.xcodebuild-tools
stkb.rewrap
stonebuddha.vscode-better-sml
szTheory.hex-lens
TabNine.tabnine-vscode
tailot.duckduckgo
teabyii.ayu
techer.open-in-browser
timonwong.shellcheck
traBpUkciP.vscode-npm-scripts
trentrand.git-rebase-shortcuts
ue.make-usestate
vlazh.yarn-update-deps
voldemortensen.rainbow-tags
vscode-icons-team.vscode-icons
wk-j.vscode-httpie
zgm.vscode-fish
