tap "artsy/formulas"
tap "clintmod/formulas"
tap "codaprotocol/coda"
tap "git-friendly/git-friendly"
tap "glepnir/jarvim"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "jcouture/nv"
tap "mongodb/brew"
tap "puma/puma"
tap "schniz/tap"
tap "smlsharp/smlsharp", "https://www.pllab.riec.tohoku.ac.jp/smlsharp/download/homebrew"
tap "superfly/tap"
tap "teamookla/speedtest"
tap "tmattio/tap"
tap "tokibi/tap"
tap "universal-ctags/universal-ctags"
brew "bat"
brew "broot"
brew "cloc"
brew "openssl@1.1"
brew "curl"
brew "direnv", link: false
brew "dockutil"
brew "duti"
brew "readline"
brew "python@3.9"
brew "eg-examples"
brew "envchain"
brew "exa"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gmp"
brew "hivemind"
brew "httpie"
brew "hub"
brew "jq"
brew "jump"
brew "lazygit"
brew "legit"
brew "libksba"
brew "libusb"
brew "mas"
brew "mycli"
brew "neovim"
brew "tmux"
brew "overmind"
brew "p11-kit"
brew "peco"
brew "ripgrep"
brew "rsync"
brew "ruby-build"
brew "sd"
brew "shellcheck"
brew "sk"
brew "ssh-copy-id"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "trash"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "z"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alacritty"
cask "firefox"
cask "hammerspoon"
cask "iterm2"
cask "postgres"
cask "postico"
cask "react-native-debugger"
cask "suspicious-package"
cask "transmission"
cask "visual-studio-code"
mas "Cleaner for Xcode", id: 1296084683
mas "Musicnotes", id: 1025073421
mas "NordVPN IKE", id: 1116599239
mas "Twitter", id: 1482454543
mas "XcLauncher", id: 1234625785
mas "Xcode", id: 497799835
